Klipper3d/klipper/lib/asf/sam/utils/cmsis/samg/samg55/include/samg55j18.h
  PERIPH_COUNT_IRQn    = 49  /**< Number of peripheral IDs */
} IRQn_Type;

typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  
  /* Cortex-M handlers */
  void* pfnReset_Handler;
  void* pfnNMI_Handler;
  void* pfnHardFault_Handler;
  void* pfnMemManage_Handler;
  void* pfnBusFault_Handler;
  void* pfnUsageFault_Handler;
  void* pfnReserved1_Handler;
  void* pfnReserved2_Handler;
  void* pfnReserved3_Handler;
  void* pfnReserved4_Handler;
  void* pfnSVC_Handler;
  void* pfnDebugMon_Handler;
  void* pfnReserved5_Handler;
  void* pfnPendSV_Handler;
  void* pfnSysTick_Handler;

  /* Peripheral handlers */
  void* pfnSUPC_Handler;    /*  0 Supply Controller */
  void* pfnRSTC_Handler;    /*  1 Reset Controller */
  void* pfnRTC_Handler;     /*  2 Real Time Clock */
  void* pfnRTT_Handler;     /*  3 Real Time Timer */
  void* pfnWDT_Handler;     /*  4 Watchdog Timer */
  void* pfnPMC_Handler;     /*  5 Power Management Controller */
  void* pfnEFC_Handler;     /*  6 Enhanced Flash Controller */
  void* pfnUSART7_Handler;       /* USART7 */
  void* pfnSPI7_Handler;       /* SPI7 */
  void* pfnTWI7_Handler;       /* TWI7 */
  void* pfnUSART0_Handler;  /* 8  FLEXCOM 0 */
  void* pfnSPI0_Handler;    /* 8  FLEXCOM 0 */
  void* pfnTWI0_Handler;    /* 8  FLEXCOM 0 */
  void* pfnUSART1_Handler;  /* 9  FLEXCOM 1 */
  void* pfnSPI1_Handler;    /* 9  FLEXCOM 1 */
  void* pfnTWI1_Handler;    /* 9  FLEXCOM 1 */
  void* pvReserved10;
  void* pfnPIOA_Handler;    /* 11 Parallel I/O Controller A */
  void* pfnPIOB_Handler;    /* 12 Parallel I/O Controller B */
  void* pfnPDMIC0_Handler;  /* 13 PDM 0 */
  void* pfnUSART2_Handler;  /* 14  FLEXCOM 2 */
  void* pfnSPI2_Handler;    /* 14  FLEXCOM 2 */
  void* pfnTWI2_Handler;    /* 14  FLEXCOM 2 */
  void* pfnMEM2MEM_Handler; /* 15 MEM2MEM */
  void* pfnI2SC0_Handler;   /* 16 I2SC0 */
  void* pfnI2SC1_Handler;   /* 17 I2SC1 */
  void* pfnPDMIC1_Handler;  /* 18 PDM 1 */
  void* pfnUSART3_Handler;  /* 19  FLEXCOM 3 */
  void* pfnSPI3_Handler;    /* 19  FLEXCOM 3 */
  void* pfnTWI3_Handler;    /* 19  FLEXCOM 3 */
  void* pfnUSART4_Handler;  /* 20  FLEXCOM 4 */
  void* pfnSPI4_Handler;    /* 20  FLEXCOM 4 */
  void* pfnTWI4_Handler;    /* 20  FLEXCOM 4 */
  void* pfnUSART5_Handler;  /* 21  FLEXCOM 5 */
  void* pfnSPI5_Handler;    /* 21  FLEXCOM 5 */
  void* pfnTWI5_Handler;    /* 21  FLEXCOM 5 */
  void* pfnUSART6_Handler;  /* 22  FLEXCOM 6 */
  void* pfnSPI6_Handler;    /* 22  FLEXCOM 6 */
  void* pfnTWI6_Handler;    /* 22  FLEXCOM 6 */
  void* pfnTC0_Handler;     /* 23 Timer/Counter 0 */
  void* pfnTC1_Handler;     /* 24 Timer/Counter 1 */
  void* pfnTC2_Handler;     /* 25 Timer/Counter 2 */
  void* pfnTC3_Handler;     /* 26 Timer/Counter 3 */
  void* pfnTC4_Handler;     /* 27 Timer/Counter 4 */
  void* pfnTC5_Handler;     /* 28 Timer/Counter 5 */
  void* pfnADC_Handler;     /* 29 Analog To Digital Converter */
  void* pfnARM_Handler;     /* 30 FPU */
  void* pvReserved31;
  void* pvReserved32;
  void* pvReserved33;
  void* pvReserved34;
  void* pvReserved35;
  void* pvReserved36;
  void* pvReserved37;
  void* pvReserved38;
  void* pvReserved39;
  void* pvReserved40;
  void* pvReserved41;
  void* pvReserved42;
  void* pvReserved43;
  void* pvReserved44;
  void* pvReserved45;
  void* pvReserved46;
  void* pfnUHP_Handler;     /* 47 USB OHCI */
  void* pfnUDP_Handler;     /* 48 USB Device FS */
  void* pvReserved49;       /*  */
  void* pvReserved50;       /*  */
  void* pvReserved51;       /*  */
  void* pvReserved52;       /*  */
  void* pvReserved53;       /*  */
  void* pvReserved54;       /*  */
  void* pvReserved55;       /*  */
  void* pvReserved56;       /*  */
  void* pvReserved57;       /*  */
  void* pvReserved58;       /*  */
  void* pvReserved59;       /*  */
  void* pvReserved60;       /*  */
  void* pvReserved61;       /*  */
  void* pvReserved62;       /*  */
  void* pvReserved63;       /* UHP */
  void* pvReserved64;       /* UDP */
  void* pvReserved65;       /* CRCCU */
} DeviceVectors;

/* Cortex-M4 core handlers */
void Reset_Handler      ( void );
void NMI_Handler        ( void );
void HardFault_Handler  ( void );
void MemManage_Handler  ( void );
void BusFault_Handler   ( void );
void UsageFault_Handler ( void );
void SVC_Handler        ( void );
void DebugMon_Handler   ( void );
void PendSV_Handler     ( void );
void SysTick_Handler    ( void );

/* Peripherals handlers */
void ADC_Handler        ( void );
void ARM_Handler        ( void );
void EFC_Handler        ( void );
void I2SC0_Handler      ( void );
void I2SC1_Handler      ( void );
void MEM2MEM_Handler    ( void );
void PDMIC0_Handler     ( void );
void PDMIC1_Handler     ( void );
void PIOA_Handler       ( void );
void PIOB_Handler       ( void );
void PMC_Handler        ( void );
void RSTC_Handler       ( void );
void RTC_Handler        ( void );
void RTT_Handler        ( void );
void SPI0_Handler        ( void );
void SPI1_Handler        ( void );
void SPI2_Handler        ( void );
void SPI3_Handler        ( void );
void SPI4_Handler        ( void );
void SPI5_Handler        ( void );
void SPI6_Handler        ( void );
void SPI7_Handler        ( void );
void SUPC_Handler       ( void );
void TC0_Handler        ( void );
void TC1_Handler        ( void );
void TC2_Handler        ( void );
void TC3_Handler        ( void );
void TC4_Handler        ( void );
void TC5_Handler        ( void );
void TWI0_Handler       ( void );
void TWI1_Handler       ( void );
void TWI2_Handler       ( void );
void TWI3_Handler       ( void );
void TWI4_Handler       ( void );
void TWI5_Handler       ( void );
void TWI6_Handler       ( void );
void TWI7_Handler       ( void );
void UDP_Handler        ( void );
void UHP_Handler        ( void );
void USART0_Handler      ( void );
void USART1_Handler      ( void );
void USART2_Handler      ( void );
void USART3_Handler      ( void );
void USART4_Handler      ( void );
void USART5_Handler      ( void );
void USART6_Handler      ( void );
void USART7_Handler      ( void );
void WDT_Handler        ( void );

/**
 * \brief Configuration of the Cortex-M4 Processor and Core Peripherals 
 */

#define __CM4_REV              0x0001 /**< SAMG55J18 core revision number ([15:8] revision number, [7:0] patch number) */
#define __MPU_PRESENT          1      /**< SAMG55J18 does provide a MPU */
#define __FPU_PRESENT          1      /**< SAMG55J18 does provide a FPU */
#define __NVIC_PRIO_BITS       4      /**< SAMG55J18 uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig 0      /**< Set to 1 if different SysTick Config is used */

