Klipper3d/klipper/lib/asf/sam/utils/cmsis/samg/samg55/include/samg55j18.h
/*
 * \brief CMSIS includes
 */

#include <core_cm4.h>
#if !defined DONT_USE_CMSIS_INIT
#include "system_samg55.h"
#endif /* DONT_USE_CMSIS_INIT */

/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAMG55J18 */
/* ************************************************************************** */
/** \addtogroup SAMG55J18_api Peripheral Software API */
/*@{*/

#include "component/adc.h"
#include "component/chipid.h"
#include "component/cmcc.h"
#include "component/crccu.h"
#include "component/efc.h"
#include "component/flexcom.h"
#include "component/gpbr.h"
#include "component/i2sc.h"
#include "component/matrix.h"
#include "component/mem2mem.h"
#include "component/pdc.h"
#include "component/pdmic.h"
#include "component/pio.h"
#include "component/pmc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/spi.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/twi.h"
#include "component/twihs.h"
#include "component/udp.h"
#include "component/usart.h"
#include "component/wdt.h"
/*@}*/

/* ************************************************************************** */
/*   REGISTER ACCESS DEFINITIONS FOR SAMG55J18 */
/* ************************************************************************** */
/** \addtogroup SAMG55J18_reg Registers Access Definitions */
/*@{*/

#include "instance/i2sc0.h"
#include "instance/i2sc1.h"
#include "instance/flexcom5.h"
#include "instance/usart5.h"
#include "instance/spi5.h"
#include "instance/twi5.h"
#include "instance/flexcom0.h"
#include "instance/usart0.h"
#include "instance/spi0.h"
#include "instance/twi0.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/flexcom3.h"
#include "instance/usart3.h"
#include "instance/spi3.h"
#include "instance/twi3.h"
#include "instance/flexcom4.h"
#include "instance/usart4.h"
#include "instance/spi4.h"
#include "instance/twi4.h"
#include "instance/flexcom1.h"
#include "instance/usart1.h"
#include "instance/spi1.h"
#include "instance/twi1.h"
#include "instance/flexcom2.h"
#include "instance/usart2.h"
#include "instance/spi2.h"
#include "instance/twi2.h"
#include "instance/mem2mem.h"
#include "instance/pdmic0.h"
#include "instance/pdmic1.h"
#include "instance/flexcom7.h"
#include "instance/usart7.h"
#include "instance/spi7.h"
#include "instance/twi7.h"
#include "instance/adc.h"
#include "instance/cmcc.h"
#include "instance/flexcom6.h"
#include "instance/usart6.h"
#include "instance/spi6.h"
#include "instance/twi6.h"
#include "instance/udp.h"
#include "instance/crccu.h"
#include "instance/uhp.h"
#include "instance/matrix.h"
#include "instance/pmc.h"
#include "instance/chipid.h"
#include "instance/efc.h"
#include "instance/pioa.h"
#include "instance/piob.h"
#include "instance/rstc.h"
#include "instance/supc.h"
#include "instance/rtt.h"
#include "instance/wdt.h"
#include "instance/rtc.h"
#include "instance/gpbr.h"
/*@}*/

/* ************************************************************************** */
/*   PERIPHERAL ID DEFINITIONS FOR SAMG55J18 */
/* ************************************************************************** */
/** \addtogroup SAMG55J18_id Peripheral Ids Definitions */
/*@{*/

#define ID_SUPC    ( 0) /**< \brief Supply Controller (SUPC) */
#define ID_RSTC    ( 1) /**< \brief Reset Controller (RSTC) */
#define ID_RTC     ( 2) /**< \brief Real Time Clock (RTC) */
#define ID_RTT     ( 3) /**< \brief Real Time Timer (RTT) */
#define ID_WDT     ( 4) /**< \brief Watchdog Timer (WDT) */
#define ID_PMC     ( 5) /**< \brief Power Management Controller (PMC) */
#define ID_EFC     ( 6) /**< \brief Enhanced Flash Controller (EFC) */
#define ID_USART7  ( 7) /**< \brief FLEXCOM 7 (USART7) */
#define ID_SPI7    ( 7) /**< \brief FLEXCOM 7 (SPI7) */
#define ID_TWI7    ( 7) /**< \brief FLEXCOM 7 (TWI7) */
#define ID_USART0  ( 8) /**< \brief FLEXCOM 0 (USART0) */
#define ID_SPI0    ( 8) /**< \brief FLEXCOM 0 (SPI0) */
#define ID_TWI0    ( 8) /**< \brief FLEXCOM 0 (TWI0) */
#define ID_USART1  ( 9) /**< \brief FLEXCOM 1 (USART1) */
#define ID_SPI1    ( 9) /**< \brief FLEXCOM 1 (SPI1) */
#define ID_TWI1    ( 9) /**< \brief FLEXCOM 1 (TWI1) */
#define ID_PIOA    (11) /**< \brief Parallel I/O Controller A (PIOA) */
#define ID_PIOB    (12) /**< \brief Parallel I/O Controller B (PIOB) */
#define ID_PDMIC0  (13) /**< \brief PDM 0 (PDMIC0) */
#define ID_USART2  (14) /**< \brief FLEXCOM2 (USART2) */
#define ID_SPI2    (14) /**< \brief FLEXCOM2 (SPI2) */
#define ID_TWI2    (14) /**< \brief FLEXCOM2 (TWI2) */
#define ID_MEM2MEM (15) /**< \brief MEM2MEM (MEM2MEM) */
#define ID_I2SC0   (16) /**< \brief I2SC0 (I2SC0) */
#define ID_I2SC1   (17) /**< \brief I2SC1 (I2SC1) */
#define ID_PDMIC1  (18) /**< \brief PDM 1 (PDMIC1) */
#define ID_USART3  (19) /**< \brief FLEXCOM3 (USART3) */
#define ID_SPI3    (19) /**< \brief FLEXCOM3 (SPI3) */
#define ID_TWI3    (19) /**< \brief FLEXCOM3 (TWI3) */
#define ID_USART4  (20) /**< \brief FLEXCOM4 (USART4) */
#define ID_SPI4    (20) /**< \brief FLEXCOM4 (SPI4) */
#define ID_TWI4    (20) /**< \brief FLEXCOM4 (TWI4) */
#define ID_USART5  (21) /**< \brief FLEXCOM5 (USART5) */
#define ID_SPI5    (21) /**< \brief FLEXCOM5 (SPI5) */
#define ID_TWI5    (21) /**< \brief FLEXCOM5 (TWI5) */
#define ID_USART6  (22) /**< \brief FLEXCOM6 (USART6) */
#define ID_SPI6    (22) /**< \brief FLEXCOM6 (SPI6) */
#define ID_TWI6    (22) /**< \brief FLEXCOM6 (TWI6) */
#define ID_TC0     (23) /**< \brief Timer/Counter 0 (TC0) */
#define ID_TC1     (24) /**< \brief Timer/Counter 1 (TC1) */
#define ID_TC2     (25) /**< \brief Timer/Counter 2 (TC2) */
#define ID_TC3     (26) /**< \brief Timer/Counter 3 (TC3) */
#define ID_TC4     (27) /**< \brief Timer/Counter 4 (TC4) */
#define ID_TC5     (28) /**< \brief Timer/Counter 5 (TC5) */
#define ID_ADC     (29) /**< \brief Analog To Digital Converter (ADC) */
#define ID_ARM     (30) /**< \brief FPU (ARM) */
#define ID_UHP     (47) /**< \brief USB OHCI (UHP) */
#define ID_UDP     (48) /**< \brief USB Device FS (UDP) */
#define ID_CRCCU   (49) /**< \brief CRCCU (CRCCU) */

